[
    {"category": "personal",
    "question": "What's your favorite color?",
    "description": "Colors are important because that can help you find, characteristics in your partner, as help you choose clothes, furniture and gifts."},
    {"category": "personal",
    "question": "What’s your favorite nickname?",
    "description": "Asking about a nickname will not only give you ideas about what to call your new partner, but it will also likely elicit a story about the loved one that coined the name."},
    {"category": "personal",
    "question": "When is your birthday?",
    "description": "Give your partner closure and celebrate together a special day like this, was the day that the love of your life came to this world, celebrate and be grateful for life."},
    {"category": "personal",
    "question": "What's your favorite place?",
    "description": "Some places would be for fun or only because they are beautiful, but some are meaningful depending of the stage of your partner's life."},
    {"category": "personal",
    "question": "What’s your weirdest habit or quirk?",
    "description": "Might as well know what to prepare yourself for! Asking about a weird habit or quirk before it comes up will save you the surprise of discovering it on your own."},
    {"category": "personal",
    "question": "Do you like to cook?",
    "description": "Before you live with someone, you never really know if they enjoy cooking (or if they know how to cook) unless you ask! Cooking can be a super fun way to pass the time as a couple, whether it’s teaching your partner, learning from your partner or cooking as a team"},
    {"category": "personal",
    "question": "What’s your favorite meal?",
    "description": "Learn about your partner’s favorite meal and pledge to cook it together as a fun date night activity."},
    {"category": "personal",
    "question": "What were you like in high school?",
    "description": "While not all high school stereotypes are true, understanding what your partner was like in high school can give you a general idea of what they were like when they were younger."},
    {"category": "personal",
    "question": "What’s your greatest talent?",
    "description": "Let your new partner brag about themselves! Asking them about their greatest talent will give you insight into something that they are proud of."},
    {"category":"personal",
    "question": "What’s your biggest weakness?",
    "description": "While it’s great to hype your partner up, it’s also important to understand what their flaws are. Asking this question will not only encourage them to reflect a little, but it will also give you a heads up about their flaws."},
    {"category": "love language",
    "question": "What is your love language?",
    "description": "Love languages are super important to understand when you are starting a new relationship. Asking your partner about their preferred ways to give and receive love will help you support them in the relationship moving forward."},
    {"category":"love language",
    "question": "What is your conflict style?",
    "description": "It’s important to understand your new partner’s conflict style so that when conflicts do eventually arise, you are able to navigate them effectively."},
    {"category":"love language",
    "question": "What are your expectations for the relationship?",
    "description": "In addition to light hearted questions, it’s good to establish expectations for the relationship early on. This often won’t come up out of the blue, so it can be important to directly ask your partner this question so that you are on the same page about things moving forward."},
    {"category":"love language",
    "question": "What’s the best gift you have ever received?",
    "description": "Asking about your partner’s favorite gift will not only give you insight into the kind of things that your partner values, but it will also give you ideas for the next gift giving occasion!"},
    {"category":"love language",
    "question": "Why did your last relationship end?",
    "description": "In a mature relationship, you and your partner should be able to talk about your past partners and relationships. Understanding why their last relationship ended can show you what the deal breakers are for your partner."},
    {"category":"love language",
    "question": "What's your favorite thing about me?",
    "description": "Sometimes, we don't see us as other people do, this is a real opportunity to discover yourself in another's person eyes."},
    {"category":"love language",
    "question": "What makes you feel the most loved?",
    "description": "In addition to knowing your partner’s love language, it’s important to know what specific things make them feel most loved. A box of chocolates? Taking time to go on a walk? Leaving little notes around the house? Sending a cute good morning text?."},
    {"category":"love language",
    "question": "What makes you feel better when having a hard day?",
    "description": "Sometimes we have hard days, what are those things that would make you feel better?"},
    {"category":"love language",
    "question": "What are some little things that I could improve at home?",
    "description": "Helping around home is important and sometimes overwelming, helping each other to make life together easy and enjoyable. Starting from home.",
    {"category": "family",
    "question": "What's your family dinamic?",
    "description": "Understanding your new partner’s family dynamic, or at least where they fall in the birth order of their siblings will give you insight into who they are."},
    {"category": "family",
    "question": "How would you describe your spending habits?",
    "description": "Financial disagreements are often the source of relationship problems. Understanding your new partner’s spending habits from the beginning will help you make sure you’re on the same page, or it will at least give you insight into your different spending habits. In the short term it’s also good to know to help you better understand who’s getting the bill."},
    {"category": "family",
    "question": "Are you a competitive person?",
    "description": "Many people have somewhat hidden competitive streaks that come out in full force during certain activities. Knowing if your partner is competitive, or having them admit that they are competitive can prepare you when the streak comes out."},
    {"category": "family",
    "question": "How can I help with the kids?",
    "description": "Raising kids is hard, but can get easier if the communication is good."},
    {"category": "family",
    "question": "What place would be a good vacation?",
    "description": "Who doesn’t want to plan out a dream vacation?! Asking about your partner’s dream vacay will prompt a fun conversation and will maybe even inspire your next trip."},
    {"category": "family",
    "question": "Give me a compliment!",
    "description": "One way to show love and support is telling your partner something nice from nowhere."},
    {"category": "family",
    "question": "What is your favorite childhood memory?",
    "description": "Asking about your partner’s childhood, especially the good parts, will let you get to know them on a deeper level and will show you the things and people that are important to them."},
    {"category": "family",
    "question": "What is your favorite family night activity?",
    "description": "Does your partner prefer a quiet night in? A night on the town? Or a fancy romantic dinner? Knowing this and changing things up if you have different preferences will keep date night fun for everyone."},
    {"category": "personal",
    "question": "What’s your favorite song?",
    "description": "Superlatives are a great way to get to know your partner better. Whether you’re asking about a favorite song, a favorite artist, or even a favorite movie, superalities are a fun conversation starter."},
    {"category": "personal",
    "question": "What’s your favorite sport’s team?",
    "description": "Does a disagreement about sports teams count as an irreconcilable difference? Maybe! Better to find out sooner rather than later. Or atleast plan out which games you should spend apart from each other."},
    {"category":"love language",
    "question": "What’s the best way to surprise you?",
    "description": "Show some love and surprise me!"},
    {"category": "love language",
    "question": "What’s your favorite date night activity?",
    "description": "Does your partner prefer a quiet night in? A night on the town? Or a fancy romantic dinner? Knowing this and changing things up if you have different preferences will keep date night fun for everyone."},
    {"category": "personal",
    "question": "What’s your favorite romcom?",
    "description": "Everyone has a favorite romcom, even if they are slow to admit it. Knowing whether your partner is a 500 Days of Summer person or a 10 Things I Hate About your kind of person is important!."},
    {"category": "family",
    "question": "What are your goals in life?",
    "description": "Having goals together, is important because you can work as a team to reach them, but if the goals are not alike; in the future could cause some troubles because goals that are not shared, are more difficult to reach and the other person doesn't understand the importance in your life."}
]
